# 6. Необходимо создать (не программно) текстовый файл, где каждая строка описывает
# учебный предмет и наличие лекционных, практических и лабораторных занятий по этому предмету и их количество.
# Важно, чтобы для каждого предмета не обязательно были все типы занятий.
# Сформировать словарь, содержащий название предмета и общее количество занятий по нему.
# Вывести словарь на экран.

# Примеры строк файла:
# Информатика: 100(л) 50(пр) 20(лаб).
# Физика: 30(л) — 10(лаб)
# Физкультура: — 30(пр) —
#
# Пример словаря:
# {“Информатика”: 170, “Физика”: 40, “Физкультура”: 30}

output = {}

with open('lesson56.txt', encoding="utf-8") as f_obj:
    for lines in f_obj:
        les = 0
        for i in lines.split():
            try:
                les += int(i.strip('(л)(пр)(лаб)—'))
            except:
                pass
        output[lines.split()[0]] = les

print(output)